// Дедлайн: 04.08.2022
//
// 1) Даны два массива: ['a', 'b', 'c'] и [1, 2, 3]. Объедините их вместе.
// 1) Даны два массива: ['a', 'b', 'c'] и [1, 2, 3]. Объедините их вместе.

// const arrOne = ['a', 'b', 'c'];
// const arrTwo = [1, 2, 3];
// const arrAll = arrOne.concat(arrTwo);
// console.log(arrAll);

// 2) Дан массив ['a', 'b', 'c']. Добавьте ему в конец элементы 1, 2, 3. (через push и через splice)

// const arrOne = ['a', 'b', 'c'];
// arrOne.push(1, 2, 3);
// console.log(arrOne)
//
// const arrTwo = ['a', 'b', 'c'];
// arrTwo.splice(3,0,1, 2, 3);
// console.log(arrTwo)


// 3) Дан массив [1, 2, 3, 4, 5]. С помощью метода splice преобразуйте массив в [1, 4, 5].

// const arr = [1, 2, 3, 4, 5];
// arr.splice(1,2,);
// console.log(arr)


// 4) Дан массив [1, 2, 3, 4, 5]. С помощью метода splice сделайте из него массив [1, 2, 3, 'a', 'b', 'c', 4, 5].

// const arr = [1, 2, 3, 4, 5];
// arr.splice(3,0,'a','b','c');
// console.log(arr)


// 5) Дан массив const arr = [1, 2, 3, 4, 5]. Создать новый пустой массив arr1. Обойти массив arr через цикл for, каждый элемент массива arr умножить на 10 и результат положить в массив arr1.

// const arr = [1, 2, 3, 4, 5];
// const arr1 = [];
// for (let i = 1 ; i <= arr.length ; i++) {
//     let x = i * 10;
//     arr1.push(x)
//
// }
// console.log(arr1);

// 6) Вывести числа от 4 до 400 на экран.
//
// const arr = [];
// for ( let i = 4; i <= 400; i++) {
//     arr.push(i);
//
// }
// console.log(arr)


// 7) Вывести числа в последовательности: 4 7 10 13 с помощью цикла.

// const arr = [];
// for (let i = 4; i <= 13; i = i + 3) {
//     arr.push(i);
// }
// console.log(arr)


// 8) Вывести числа 654 653 652 до нуля.

// const arr = [];
// for (let i = 0; i <= 654; i++) {
//     arr.push(i);
//     arr.reverse()
// }
// console.log(arr);
//

// 9) Вывести все годы с 1983 до 2017.

// const arr = [];
// for (let i = 1983; i <= 2017; i++) {
//     arr.push(i)
// }
// console.log(arr);


// 10) Вывести числа -4 -2 0 2 4 6 ...100.

// const arr = [];
// for (let i = -4; i <= 100; i = i + 2) {
//     arr.push(i);
// }
// console.log(arr)


// 11) Найти сумму чисел от 0 до 100 (включительно). (0+1+2+3+4+5)

// let num = 0;
// for (let i = 0; i <= 100; i++) {
//     num += i
// }
// console.log(num);

// 12) Заполните массив следующим образом: в первый элемент запишите 'x',
//     во второй 'xx', в третий 'xxx' и так далее. Длину массива вводить через prompt.

// const random = +prompt('Введите число');
// const arr = [];
// let arrOne = '';
// for (let i = 1; i <=random ; i++) {
//     arrOne += 'x';
//     arr.push(arrOne)
//
// }
// console.log(arr);

// 13) Заполните массив следующим образом: в первый элемент запишите '1',
//     во второй '22', в третий '333' и так далее. Длину массива вводить через prompt.

// const numberRandom = +prompt('Введите число');
// const arr = [];
//
// for ( let i = 1; i <=numberRandom; i++) {
//   let num = '';
//     for (let j = 1; j <= i; j++) {
//         num += i
//     }
//     arr.push(num)
// }
// console.log(arr)


// 14*) нарисовать матрицу x должны быть по краям, 0 в центре. ( длина и высота матрицы не меньше 10 )
// ['x', 'x', 'x', 'x', 'x' 'x', 'x']
//     ['x', 0, 0, 0, 0, 0, 0, 0, 0, 'x']
//     ['x', 0, 0, 0, 0, 0, 0, 0, 0, 'x']
//     ['x', 0, 0, 0, 0, 0, 0, 0, 0, 'x']
//     ['x', 0, 0, 0, 0, 0, 0, 0, 0, 'x']
//     ['x', 0, 0, 0, 0, 0, 0, 0, 0, 'x']
//     ['x', 0, 0, 0, 0, 0, 0, 0, 0, 'x']
//     ['x', 0, 0, 0, 0, 0, 0, 0, 0, 'x']
//     ['x', 0, 0, 0, 0, 0, 0, 0, 0, 'x']
//     ['x', 'x', 'x', 'x', 'x', 'x','x']

//
// const arr = [];
// for (let i = 0; i < 10; i++) {
//     let arrTwo = [];
//     for (let j = 0; j < 10; j++) {
//         if (i === 0 || i === 9) {
//             arrTwo.push('x')
//          } else if (j === 0 || j === 9) {
//              arrTwo.push('x')
//         } else {
//             arrTwo.push('0')
//         }
//     }
//     arr.push(arrTwo)
// }
// console.log(arr);


//
// 15*) нарисовать матрицу (таблица умножения)
// 0: (10) [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
// 1: (10) [2, 4, 6, 8, 10, 12, 14, 16, 18, 20]
// 2: (10) [3, 6, 9, 12, 15, 18, 21, 24, 27, 30]
// 3: (10) [4, 8, 12, 16, 20, 24, 28, 32, 36, 40]
// 4: (10) [5, 10, 15, 20, 25, 30, 35, 40, 45, 50]
// 5: (10) [6, 12, 18, 24, 30, 36, 42, 48, 54, 60]
// 6: (10) [7, 14, 21, 28, 35, 42, 49, 56, 63, 70]
// 7: (10) [8, 16, 24, 32, 40, 48, 56, 64, 72, 80]
// 8: (10) [9, 18, 27, 36, 45, 54, 63, 72, 81, 90]
// 9: (10) [10, 20, 30, 40, 50, 60, 70, 80, 90, 100]

//
// let umn = [];
// for ( let i = 1; i <= 10 ; i++) {
//     let umnOne = [];
//     for ( let j = 1; j <= 10; j++) {
//         umnOne.push(i*j);
//     }
//     umn.push(umnOne)
// }
// console.log(umn)
//

// 16*)	Написать программу которая будет склонять слово
// 	“товар” в зависимости от количества товаров в корзине.
//     Например 1 - товар, 4 - товара, 6 - товаров.

//
// let product = +prompt('Введите сколько товаров вы хотите приобрести');
//
// if (product >= 5 && product <= 20 || (product - 5) % 10 === 0 || (product - 6) % 10 === 0 || (product - 7) % 10 === 0
//     || (product - 8) % 10 === 0 || (product - 9) % 10 === 0 || (product - 11) % 100 === 0) {
//     alert(`Вы приобрели ${product} товаров`);
// } else if (product === 1 || (product - 1) % 10 === 0) {
//     alert(`Вы приобрели ${product} товар`);
// } else alert(`Вы приобрели ${product} товара`);
//








